<?php
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 系统基本配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 平台设置(平台值单词首字母大写)
 */
App::set('Platform', '4399');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 网关,资源路径设置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 网关URL(必须以"/"结尾)
 */
//define('GATEWAY_URL', 'http://alice4399.fanhougame.com/');
define('GATEWAY_URL', 'http://alice4399.fanhouapp.com/');

/**
 * 资源URL(必须以"/"结尾)
 */
define('RESOURCE_URL', 'http://res.fanhougame.com/alice4399/');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 开关设置(1=打开,0=关闭)
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 记录异常(按需开启)
 */
define('LOG_EXCEPTION', 1);

/**
 * 记录失败的服务(按需开启)
 */
define('LOG_FAIL_SERVICE', 1);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 应用信息配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 应用URL(必须以"/"结尾)
 */
define('APP_URL', 'http://my.4399.com/userapp.php?id=100223');
/**
 * 应用发布时间
 */
define('APP_PUB_DATE', '2011-11-08');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 数据库,缓存服务器等配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * MySQL服务器配置
 * array(
 *     类型.模块 => array(
 *         节点编号 => array($host, $port, $username, $password, $dbname, $charset),
 *     )
 * )
 */
App::set(
                'MySQLServer',
                array(
                    'main.public' => array(
                        360 => array('192.168.1.42', 3306, 'P0107playonline', 'P0107online@fhdbv5!', 'P01071000000', 'utf8'),
                    ),
                    'circle.log' => array(
                        360 => array('192.168.1.42', 3306, 'P0107playonline', 'P0107online@fhdbv5!', 'P01072000000', 'utf8'),
                    ),
                    'main.stat' => array(
                        360 => array('192.168.1.42', 3306, 'P0107playonline', 'P0107online@fhdbv5!', 'P01073000000', 'utf8'),
                    ),
                )
);

/**
 * Redis服务器配置
 * array(
 *     类型.模块 => array(
 *         节点编号 => array($host, $port),
 *     )
 * )
 */
App::set(
                'RedisServer',
                array(
                    'main.public' => array(
                        360 => array('192.168.1.42', 6400, 0),
                    ),
                    'main.relation' => array(
                        360 => array('192.168.1.42', 6400, 1),
                    ),
                    'main.stat' => array(
                        360 => array('192.168.1.42', 6400, 2),
                    ),
                    'circle.user' => array(
                        360 => array('192.168.1.42', 6400, 3),
                    ),
                    'circle.friend' => array(
                        360 => array('192.168.1.42', 6400, 4),
                    ),
                )
);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 其他配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 默认好友
 */
App::set(
                'DefaultFriend',
                array(
                    'exp' => 153805510,
                    'head_img' => 'http://a.img4399.com/358134791/middle',
                    'sns_uid' => '358134791',
                    'user_id' => 1,
                    'username' => '莱利亚',
                    'wish_items' => '',
                    'is_default' => 1,
                )
);

/**
 * 排行榜更新间隔(s)
 */
App::set('TopDataUpdateInterval', 3600);

/**
 * 七夕情人节活动标志(2011-08-06 00:00:00 - 2011-08-17 00:00:00)
 */
//if (CURRENT_TIME >= 1312560000 && CURRENT_TIME < 1313510400) {
//    define('FESTIVAL_7_7_FLAG', 1);
//} else if (CURRENT_TIME >= 1313510400) {
//    define('FESTIVAL_7_7_FLAG', 2);
//}

/**
 * 10人宝箱活动标志(2011-08-06 00:00:00 - ?)
 */
if (CURRENT_TIME >= 1312560000) {
    define('ACTIVITY_OPEN_CHEST', 1);
}

/**
 * 百人达活动标志(2011-08-06 00:00:00 - ?)
 */
if (CURRENT_TIME >= 1312560000) {
    define('ACTIVITY_INVITE_FRIEND', 1);
}

/**
 * 资源配置文件签名
 */
if (isset($_COOKIE['ALICE_TEST_ENV'])) { // 测试环境
    define('IS_TEST_SERVER', 1);
    define('LOADING_SIGN', '20120105');
    define('RESOURCE_SIGN', '12b2kw4');
} else { // 正式环境
    define('LOADING_SIGN', '20120105');
    define('RESOURCE_SIGN', '12b2kw4');
}
?>