-- phpMyAdmin SQL Dump
-- version 3.4.7.1
-- http://www.phpmyadmin.net
--
-- 主机: 192.168.0.222:3306
-- 生成日期: 2011 年 12 月 26 日 15:32
-- 服务器版本: 5.1.49
-- PHP 版本: 5.3.5

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `alice_main`
--

--
-- 转存表中的数据 `area_data`
--

INSERT INTO `area_data` (`area_id`, `zone_id`, `place_id`, `name`, `description`, `need_grade`, `need_energy`, `is_open`, `node_count`) VALUES
(0, 1, 1, '新手关卡', '用于新手引导', 1, 5, 1, 0),
(1, 1, 1, '稻田', '田园里的稻田。是村里小孩子的捉迷藏宝地，不过稻田经常会被糟蹋。传言此地曾经有小孩失踪过。', 1, 5, 1, 20),
(2, 1, 1, '金色麦野', '彩虹村村民们种植小麦的地方。微风吹过，一边金色的波浪。整齐的麦格，让麦田分成一块一块。', 4, 5, 1, 20),
(3, 1, 1, '清风林', '在迷影森林边缘的一片森林，林中的树叶会随着清风起舞，这里的清风菇是彩虹村人们最爱的食物。', 7, 5, 1, 20),
(4, 1, 1, '神秘树屋', '迷影森林深处的一片诡异的森林，在里面有着许多奇形怪状的树屋，有传言树屋里住着的不是精灵而是树妖。', 10, 5, 1, 20),
(5, 2, 2, '回音谷', '回音是回答式的神奇山谷，里面树木茂盛，鸟类繁多。', 14, 6, 1, 20),
(6, 2, 2, '百花池', '毗邻梦幻瀑布，水源充足，鲜花遍野，绿树成荫。', 16, 101, 1, 20),
(7, 2, 2, '梦幻瀑布', '七色的水流从高处缓缓留下，形成了瀑布，犹如一片人间仙境。', 18, 101, 1, 20),
(8, 2, 2, '洪特尔郊外', '洪特尔人所居住的聚集地的郊外，是洪特尔人打猎、采集食物的地方', 21, 7, 1, 20),
(9, 2, 2, '深幽密林', '毗邻梦幻瀑布，水源充足，鲜花遍野，绿树成荫。', 26, 8, 1, 20),
(10, 3, 3, '科迪瓦城墙', '', 1, 0, 1, 30),
(11, 3, 3, '码头', '', 1, 0, 1, 30),
(12, 3, 3, '贫民窟', '', 1, 0, 1, 30),
(13, 3, 3, '皇家城堡', '', 1, 0, 1, 30),
(14, 3, 3, '藏书阁', '', 1, 0, 1, 30),
(9998, 2, 2, '付费地区', '付费地区', 1, 0, 1, 0),
(9999, 1, 1, '临时地区', '临时地区', 1, 5, 1, 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
