<?php
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 系统基本配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 平台设置(平台值单词首字母大写)
 */
App::set('Platform', 'Devel');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 网关,资源路径设置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 网关URL(必须以"/"结尾)
 */
define('GATEWAY_URL', 'http://alice-dev.fanhougame.com/alice/');

/**
 * 资源URL(必须以"/"结尾)
 */
define('RESOURCE_URL', 'http://alice-res.fanhougame.com/alice/');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 开关设置(1=打开,0=关闭)
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 记录异常(按需开启)
 */
define('LOG_EXCEPTION', 1);

/**
 * 记录失败的服务(按需开启)
 */
define('LOG_FAIL_SERVICE', 1);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 应用信息配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 应用URL(必须以"/"结尾)
 */
define('APP_URL', 'http://alice-dev.fanhougame.com/');
/**
 * 应用发布时间
 */
define('APP_PUB_DATE', '2011-07-25');


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 数据库,缓存服务器等配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * MySQL服务器配置
 * array(
 *     类型.模块 => array(
 *         节点编号 => array($host, $port, $username, $password, $dbname, $charset),
 *     )
 * )
 */
App::set(
                'MySQLServer',
                array(
                    'main.public' => array(
                        360 => array('192.168.0.222', 3306, 'player_devel', 'test_devel@fhdbv5!', 'alice_main', 'utf8'),
                    ),
                    'circle.log' => array(
                        1 => array('192.168.0.222', 3306, 'player_devel', 'test_devel@fhdbv5!', 'alice_circle', 'utf8'),
                    ),
                    'main.stat' => array(
                        360 => array('192.168.0.222', 3306, 'player_devel', 'test_devel@fhdbv5!', 'alice_stat', 'utf8'),
                    ),
                )
);

/**
 * Redis服务器配置
 * array(
 *     类型.模块 => array(
 *         节点编号 => array($host, $port, $index),
 *     )
 * )
 */
App::set(
                'RedisServer',
                array(
                    'main.public' => array(
                        360 => array('192.168.0.222', 7000, 0),
                    ),
                    'main.relation' => array(
                        360 => array('192.168.0.222', 7000, 1),
                    ),
                    'main.stat' => array(
                        360 => array('192.168.0.222', 7000, 2),
                    ),
                    'circle.user' => array(
                        1 => array('192.168.0.222', 7000, 3),
                    ),
                    'circle.friend' => array(
                        1 => array('192.168.0.222', 7000, 4),
                    ),
                )
);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 其他配置
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * 默认好友
 */
App::set(
                'DefaultFriend',
                array(
                    'exp' => 153805510,
                    'head_img' => 'http://py2.qlogo.cn/campus/b15287a5891ba4e185b6b0e22e4aad92274e8d2a0f7321604b6ae1dfc157f84e61a7c1dad099c473/60',
                    'sns_uid' => '000000000000000000000000006E77D4',
                    'user_id' => 1,
                    'username' => '莱利亚',
                    'wish_items' => '',
                    'is_default' => 1,
                )
);

/**
 * 排行榜更新间隔(s)
 */
App::set('TopDataUpdateInterval', 1800);

/**
 * 七夕情人节活动标志(2011-08-06 00:00:00 - 2011-08-17 00:00:00)
 */
//if (CURRENT_TIME >= 0 && CURRENT_TIME <= 1313510400) {
//    define('FESTIVAL_7_7_FLAG', 1);
//} else if (CURRENT_TIME > 1313510400) {
//    define('FESTIVAL_7_7_FLAG', 2);
//}

/**
 * 资源配置文件签名
 */
if (isset($_SERVER['SERVER_ADDR']) && in_array($_SERVER['SERVER_ADDR'], array())) { // 测试环境
    define('IS_TEST_SERVER', 1);
    define('LOADING_SIGN', '20120106');
    define('RESOURCE_SIGN', 'default');
} else { // 正式环境
    define('LOADING_SIGN', '20120106');
    define('RESOURCE_SIGN', 'default');
}
?>